{
  "architectures": [
    "DeepseekV2ForCausalLM"
  ],
  "premix_att_moe": false,
  "no_ffn_moe": true,
  "share_att_ffn_moe": false,
  "res_query_lora": true,
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_deepseek.DeepseekV2Config",
    "AutoModel": "modeling_deepseek.DeepseekV2Model",
    "AutoModelForCausalLM": "modeling_deepseek.DeepseekV2ForCausalLM"
  },
  "aux_loss_alpha": 0.001,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "vocab_size": 32000,
  "ep_size": 1,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5632,
  "moe_intermediate_size": 512,
  "max_position_embeddings": 1024,
  "model_type": "PremixMoe_v2",
  "moe_layer_freq": 1,
  "n_routed_experts": 57,
  "n_shared_experts": 1,
  "num_experts_per_tok": 3,
  "num_attention_heads": 4,
  "num_key_value_heads": 4,
  "num_hidden_layers": 24,
  "pretraining_tp": 1,
  "q_lora_rank": null,
  "qk_nope_head_dim": 448,
  "qk_rope_head_dim": 64,
  "v_head_dim": 512,
  "rms_norm_eps": 1e-06,
  "rope_theta": 10000,
  "routed_scaling_factor": 1.0,
  "scoring_func": "softmax",
  "seq_aux": true,
  "tie_word_embeddings": false,
  "topk_group": 3,
  "topk_method": "greedy",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.39.3",
  "use_cache": true
}